src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/НастройкиИнтеграцииКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииКабинетСотрудника</name>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяКадровыйЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособПолученияСогласияНаПрисоединениеККЭДО</name>
    <type>
      <types>EnumRef.СпособыПолученияСогласияНаПрисоединениеККЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбсуждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧатБот</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КоординаторОбсуждений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложенияСовместногоИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛисток</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРасчетныеЛистыОтдельнымЗапросом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/ИспользуемаяФункциональностьСервисаКабинетСотрудника/ИспользуемаяФункциональностьСервисаКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользуемаяФункциональностьСервисаКабинетСотрудника</name>
  <resources>
    <name>ЗаявленияНаДСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВПроцентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВСуммой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВПроцентомНеБолееСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьРазделКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьРазделСправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьРазделДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомпенсацияОтпускаНедоступна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучениеДокументаСЭПНедоступно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УровеньДоступаКИ</name>
    <type>
      <types>EnumRef.УровниДоступаКИнформацииОСотрудниках</types>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОбОстаткахОтпусковНедоступна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступенОтказОтПодписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЗаявленияНаПереносОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЗаявленияНаОтменуОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьОхрануТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновитьНастройкиФункциональностьСервиса") Тогда
		РегистрыСведений.НастройкиСервисаКабинетСотрудника.УстановитьТребуетсяОбновитьНастройкиФункциональности(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЭтотОбъект.Количество() > 0 Тогда
		ИспользуетсяКадровыйЭДО = ЭтотОбъект[0].ИспользуетсяКадровыйЭДО;
		БизнесПроцессыЗаявокСотрудников.ПроверитьИИзменитьЗначениеНастроек(ИспользуетсяКадровыйЭДО);
		КадровыйЭДО.УстановитьЗначениеВедетсяУчетСогласийНаПрисоединениеККЭДО(ИспользуетсяКадровыйЭДО);
		Настройки = РегистрыСведений.ИспользуемаяФункциональностьСервисаКабинетСотрудника.Настройки();
		Если ИспользуетсяКадровыйЭДО Тогда
			Если Настройки.СкрытьРазделДокументы Или Настройки.ПолучениеДокументаСЭПНедоступно Тогда
				Настройки.СкрытьРазделДокументы = Ложь;
				Настройки.ПолучениеДокументаСЭПНедоступно = Ложь;
				РегистрыСведений.ИспользуемаяФункциональностьСервисаКабинетСотрудника.СохранитьНовыеНастройки(Настройки)
			КонецЕсли;
		Иначе
			Если Настройки.ДоступенОтказОтПодписания Тогда
				Настройки.ДоступенОтказОтПодписания = Ложь;
				РегистрыСведений.ИспользуемаяФункциональностьСервисаКабинетСотрудника.СохранитьНовыеНастройки(Настройки)
			КонецЕсли;
		КонецЕсли;
	Иначе
		КадровыйЭДО.УстановитьЗначениеВедетсяУчетСогласийНаПрисоединениеККЭДО(Ложь);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
